RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f5xxxx_tkey.c
/*********************************************************************************************************//**
 * @file    ht32f5xxxx_tkey.c
 * @version $Rev:: 5500         $
 * @date    $Date:: 2021-07-20 #$
 * @brief   This file provides all the TKEY firmware functions.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32f5xxxx_tkey.h"

/** @addtogroup HT32F5xxxx_Peripheral_Driver HT32F5xxxx Peripheral Driver
  * @{
  */

/** @defgroup TKEY TKEY
  * @brief TKEY driver modules
  * @{
  */


/* Private constants ---------------------------------------------------------------------------------------*/
/** @defgroup TKEY_Private_Define TKEY private definitions
  * @{
  */
#define TKCLKSEL_MASK           (0x80000000)
/**
  * @}
  */

/* Global functions ----------------------------------------------------------------------------------------*/
/** @defgroup TKEY_Exported_Functions TKEY exported functions
  * @{
  */
/*********************************************************************************************************//**
 * @brief Deinitialize the TKEY peripheral registers to their default reset values.
 * @retval None
 ************************************************************************************************************/
void TKEY_DeInit(void)
{
  RSTCU_PeripReset_TypeDef RSTCUReset = {{0}};

  RSTCUReset.Bit.TKEY = 1;
  RSTCU_PeripReset(RSTCUReset, ENABLE);
}

/*********************************************************************************************************//**
 * @brief Configure Touch key IP clock source.
 * @param Sel: Specify the Touch key IP clock source..
 *   This parameter can be one of the following values:
 *     @arg TKEY_PCLK : PCLK.
 *     @arg TKEY_LSI : LSI.
 * @retval None
 ************************************************************************************************************/
void TKEY_IPClockConfig(TKEY_IP_CLK_Enum Sel)
{
  Assert_Param(IS_TKEY_IP_CLK(Sel));

  HT_TKEY->TKCR = (HT_TKEY->TKCR & TKCLKSEL_MASK) | (Sel << 31);
}

/*********************************************************************************************************//**
 * @brief Configure the RefOSC Delay time.
 * @param Sel: Specify the periodic auto scan mode time out.
 *   This parameter can be one of the following values:
 *     @arg TKEY_RefOSC_DelayTime_0 : 4 RefOSC clock.
 *     @arg TKEY_RefOSC_DelayTime_1 : 2 RefOSC clock.
 *     @arg TKEY_RefOSC_DelayTime_2 : 4 RefOSC clock.
 *     @arg TKEY_RefOSC_DelayTime_3 : 8 RefOSC clock.
 *     @arg TKEY_RefOSC_DelayTime_4 : 16 RefOSC clock.
 *     @arg TKEY_RefOSC_DelayTime_5 : 32 RefOSC clock.
 *     @arg TKEY_RefOSC_DelayTime_6 : 64 RefOSC clock.
 *     @arg TKEY_RefOSC_DelayTime_7 : 4 RefOSC clock.
 * @retval None
 ************************************************************************************************************/
void TKEY_RefOSCDelayTimeConfig(TKEY_RefOSC_DelayTime_Enum Sel)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TKEY_RefOSC_DelayTime(Sel));

  HT_TKEY->TKCR = (HT_TKEY->TKCR & ~(7 << 13)) | Sel;
}
/*********************************************************************************************************//**
 * @brief Configure the periodic auto scan mode time out.
 * @param Sel: Specify the periodic auto scan mode time out.
 *   This parameter can be one of the following values:
 *     @arg TKEY_PASM_TIMEOUT_0 : 2^13/FLIRC.
 *     @arg TKEY_PASM_TIMEOUT_1 : 2^14/FLIRC.
 *     @arg TKEY_PASM_TIMEOUT_2 : 2^15/FLIRC.
 *     @arg TKEY_PASM_TIMEOUT_3 : 2^16/FLIRC.
 *     @arg TKEY_PASM_TIMEOUT_4 : 2^17/FLIRC.
 *     @arg TKEY_PASM_TIMEOUT_5 : 2^18/FLIRC.
 * @retval None
 ************************************************************************************************************/
void TKEY_PASMTimeoutConfig(TKEY_PASM_TIMEOUT_Enum Sel)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TKEY_PASM_TIMEOUT(Sel));

  HT_TKEY->TKCR = (HT_TKEY->TKCR & ~(7 << 10)) | Sel;
}

/*********************************************************************************************************//**
 * @brief Configure the periodic auto scan mode period.
 * @param Sel: Specify the periodic auto scan mode period.
 *   This parameter can be one of the following values:
 *     @arg TKEY_PASM_PERIOD_0 : 2^14/FLIRC.
 *     @arg TKEY_PASM_PERIOD_1 : 2^13/FLIRC.
 *     @arg TKEY_PASM_PERIOD_2 : 2^12/FLIRC.
 *     @arg TKEY_PASM_PERIOD_3 : 2^11/FLIRC.
 * @retval None
 ************************************************************************************************************/
void TKEY_PASMPeriodConfig(TKEY_PASM_PERIOD_Enum Sel)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TKEY_PASM_PERIOD(Sel));

  HT_TKEY->TKCR = (HT_TKEY->TKCR & ~(3 << 8)) | Sel;
}

