RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f5xxxx_tkey.c
/*********************************************************************************************************//**
 * @brief Configure the touch key 16-bit counter clock source.
 * @param Sel: Specify the 16-bit counter clock source.
 *   This parameter can be one of the following values:
 *     @arg TKEY_TK16S_CLK_0 : TKCLK/16.
 *     @arg TKEY_TK16S_CLK_1 : TKCLK/32.
 *     @arg TKEY_TK16S_CLK_2 : TKCLK/64.
 *     @arg TKEY_TK16S_CLK_3 : TKCLK/128.
 * @retval None
 ************************************************************************************************************/
void TKEY_16BitCounterClockConfig(TKEY_TK16S_CLK_Enum Sel)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TKEY_TK16S_CLK(Sel));

  HT_TKEY->TKCR = (HT_TKEY->TKCR & ~(3 << 5)) | Sel;
}

/*********************************************************************************************************//**
 * @brief Configure the touch key OSC frequency.
 * @param Sel: Specify the Touch Key frequency.
 *   This parameter can be one of the following values:
 *     @arg TKEY_TKFS_FREQ_0 : 1MHz.
 *     @arg TKEY_TKFS_FREQ_1 : 3MHz.
 *     @arg TKEY_TKFS_FREQ_2 : 7MHz.
 *     @arg TKEY_TKFS_FREQ_3 : 11MHz.
 * @retval None
 ************************************************************************************************************/
void TKEY_OSCFreqConfig(TKEY_TKFS_FREQ_Enum Sel)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TKEY_TKFS_FREQ(Sel));

  HT_TKEY->TKCR = (HT_TKEY->TKCR & ~(3 << 3)) | Sel;
}

/*********************************************************************************************************//**
 * @brief Configure the touch key operation mode.
 * @param Sel: Specify the Touch Key mode.
 *   This parameter can be one of the following values:
 *     @arg TKEY_MODE_AUTOSCAN : Auto scan mode.
 *     @arg TKEY_MODE_MANUAL   : Manual mode.
 *     @arg TKEY_MODE_PASM     : Periodic auto scan mode.
 * @retval None
 ************************************************************************************************************/
void TKEY_ModeConfig(TKEY_MODE_Enum Sel)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TKEY_MODE(Sel));

  HT_TKEY->TKCR = (HT_TKEY->TKCR & ~(3 << 1)) | Sel;
}

/*********************************************************************************************************//**
 * @brief Touch Key detection control.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void TKEY_StartCmd(ControlStatus NewState)
{
  /* Check the parameters */
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    HT_TKEY->TKCR |= (1 << 0);
  }
  else
  {
    HT_TKEY->TKCR &= ~(1 << 0);
  }
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the specified TKEY interrupt.
 * @param TKEY_Int: specify if the TKEY interrupt source to be enabled or disabled.
 *   This parameter can be any combination of the following values:
 *     @arg TKEY_INT_TKRCOVE : 8-bit time slot counter overflow interrupt
 *     @arg TKEY_INT_TKTHE   : Touch Key threshold match interrupt
 * @param  NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void TKEY_IntConfig(u32 TKEY_Int, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TKEY_INT(TKEY_Int));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    HT_TKEY->TKIER |= TKEY_Int;
  }
  else
  {
    HT_TKEY->TKIER &= ~TKEY_Int;
  }
}

/*********************************************************************************************************//**
 * @brief Check whether the specified TKEY flag has been set or not.
 * @param TKEY_Flag: specify the flag that is to be check.
 *   This parameter can be one of the following values:
 *     @arg TKEY_FLAG_TKBUSY  : Touch Key busy flag
 *     @arg TKEY_FLAG_TKCFOV  : Touch Key 16-bit C/F counter overflow flag
 *     @arg TKEY_FLAG_TK16OV  : Touch Key 16-bit counter overflow flag
 *     @arg TKEY_FLAG_TKRCOVF : 8-bit time slot counter overflow flag
 *     @arg TKEY_FLAG_TKTHF   : Touch Key threshold match flag
 * @retval SET or RESET
 ************************************************************************************************************/
FlagStatus TKEY_GetFlagStatus(u32 TKEY_Flag)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TKEY_FLAG(TKEY_Flag));

  if ((HT_TKEY->TKSR & TKEY_Flag) != RESET)
  {
    return SET;
  }
  else
  {
    return RESET;
  }
}

/*********************************************************************************************************//**
 * @brief Clear the specified TKEY flag.
 * @param TKEY_Flag: specify the flag that is to be cleared.
 *   This parameter can be one of the following values:
 *     @arg TKEY_FLAG_TKCFOV  : Touch Key 16-bit C/F counter overflow flag
 *     @arg TKEY_FLAG_TK16OV  : Touch Key 16-bit counter overflow flag
 *     @arg TKEY_FLAG_TKRCOVF : 8-bit time slot counter overflow flag
 *     @arg TKEY_FLAG_TKTHF   : Touch Key threshold match flag
 * @retval None
 ************************************************************************************************************/
void TKEY_ClearFlag(u32 TKEY_Flag)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TKEY_FLAG_CLEAR(TKEY_Flag));

  HT_TKEY->TKSR = TKEY_Flag;
}

/*********************************************************************************************************//**
 * @brief Get the touch key 16-bit counter value.
 * @retval The counter value
 ************************************************************************************************************/
u32 TKEY_Get16BitCounterValue(void)
{
  return HT_TKEY->TKCNTR;
}

