RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f5xxxx_tkey.c
/*********************************************************************************************************//**
 * @brief Set the 8-bit time slot counter reload value.
 * @param Reload: Specify the counter reload value.
 * @retval None
 ************************************************************************************************************/
void TKEY_Set8BitCounterReload(u32 Reload)
{
  HT_TKEY->TKTSCRR = Reload;
}

/*********************************************************************************************************//**
 * @brief Get the 8-bit time slot counter reload value.
 * @retval The counter reload value
 ************************************************************************************************************/
u32 TKEY_Get8BitCounterReload(void)
{
  return HT_TKEY->TKTSCRR;
}

/*********************************************************************************************************//**
 * @brief Configure the 8-bit time slot counter clock source.
 * @param TKMn: TKM_0 ~ TKM_5
 * @param Sel: Specify the 8-bit time slot counter clock source.
 *   This parameter can be one of the following values:
 *     @arg TKM_TSS_CLK_0 : Ref OSC.
 *     @arg TKM_TSS_CLK_1 : TKCLK/32.
 *     @arg TKM_TSS_CLK_2 : TKCLK/64.
 *     @arg TKM_TSS_CLK_3 : TKCLK/128.
 * @retval None
 ************************************************************************************************************/
void TKM_TimeSlotCounterClockConfig(TKM_Enum TKMn, TKM_TSS_CLK_Enum Sel)
{
  HT_TKM_TypeDef *TKMx = (HT_TKM_TypeDef *)((u32)&HT_TKEY->TKM0 + (TKMn * 0x100));

  /* Check the parameters                                                                                   */
  Assert_Param(IS_TKM(TKMn));
  Assert_Param(IS_TKM_TSS_CLK(Sel));

  TKMx->CR = (TKMx->CR & ~(3 << 8)) | Sel;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the Reference OSC.
 * @param TKMn: TKM_0 ~ TKM_5
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void TKM_RefOSCCmd(TKM_Enum TKMn, ControlStatus NewState)
{
  HT_TKM_TypeDef *TKMx = (HT_TKM_TypeDef *)((u32)&HT_TKEY->TKM0 + (TKMn * 0x100));

  /* Check the parameters                                                                                   */
  Assert_Param(IS_TKM(TKMn));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    TKMx->CR |=  (1 << 7);
  }
  else
  {
    TKMx->CR &= ~(1 << 7);
  }
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the Key OSC.
 * @param TKMn: TKM_0 ~ TKM_5
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void TKM_KeyOSCCmd(TKM_Enum TKMn, ControlStatus NewState)
{
  HT_TKM_TypeDef *TKMx = (HT_TKM_TypeDef *)((u32)&HT_TKEY->TKM0 + (TKMn * 0x100));

  /* Check the parameters                                                                                   */
  Assert_Param(IS_TKM(TKMn));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    TKMx->CR |= (1 << 6);
  }
  else
  {
    TKMx->CR &= ~(1 << 6);
  }
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the Multi-frequency.
 * @param TKMn: TKM_0 ~ TKM_5
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void TKM_MultiFreqCmd(TKM_Enum TKMn, ControlStatus NewState)
{
  HT_TKM_TypeDef *TKMx = (HT_TKM_TypeDef *)((u32)&HT_TKEY->TKM0 + (TKMn * 0x100));

  /* Check the parameters                                                                                   */
  Assert_Param(IS_TKM(TKMn));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    TKMx->CR |= (1 << 5);
  }
  else
  {
    TKMx->CR &= ~(1 << 5);
  }
}

/*********************************************************************************************************//**
 * @brief Configure the C/F OSC frequency-hopping.
 * @param TKMn: TKM_0 ~ TKM_5
 * @param Sel: Specify the C/F OSC frequency-hopping method.
 *   This paramter can be one of the following values:
 *     @arg TKM_SOF_CTRL_SW :
 *     @arg TKM_SOF_CTRL_HW :
 * @retval None
 ************************************************************************************************************/
void TKM_SOFCtrlConfig(TKM_Enum TKMn, TKM_SOF_CTRL_Enum Sel)
{
  HT_TKM_TypeDef *TKMx = (HT_TKM_TypeDef *)((u32)&HT_TKEY->TKM0 + (TKMn * 0x100));

  /* Check the parameters */
  Assert_Param(IS_TKM(TKMn));
  Assert_Param(IS_TKM_SOF_CTRL(Sel));

  TKMx->CR = (TKMx->CR & ~(1 << 3)) | Sel;
}

/*********************************************************************************************************//**
 * @brief Configure the Key OSC and the Reference OSC frequency.
 * @param TKMn: TKM_0 ~ TKM_5
 * @param Sel: Specify the OSC frequency.
 *   This paramter can be one of the following values:
 *     @arg TKM_SOF_FREQ_0 : 1.020MHz.
 *     @arg TKM_SOF_FREQ_1 : 1.040MHz.
 *     @arg TKM_SOF_FREQ_2 : 1.059MHz.
 *     @arg TKM_SOF_FREQ_3 : 1.074MHz.
 *     @arg TKM_SOF_FREQ_4 : 1.085MHz.
 *     @arg TKM_SOF_FREQ_5 : 1.099MHz.
 *     @arg TKM_SOF_FREQ_6 : 1.111MHz.
 *     @arg TKM_SOF_FREQ_7 : 1.125MHz.
 * @retval None
 ************************************************************************************************************/
void TKM_SOFFreqConfig(TKM_Enum TKMn, TKM_SOF_FREQ_Enum Sel)
{
  HT_TKM_TypeDef *TKMx = (HT_TKM_TypeDef *)((u32)&HT_TKEY->TKM0 + (TKMn * 0x100));

  /* Check the parameters */
  Assert_Param(IS_TKM(TKMn));
  Assert_Param(IS_TKM_SOF_FREQ(Sel));

  TKMx->CR = (TKMx->CR & ~(7 << 0)) | Sel;
}

