RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f5xxxx_tkey.c
/*********************************************************************************************************//**
 * @brief Enable or Disable the specified Touch Key.
 * @param TKMn: TKM_0 ~ TKM_5
 * @param Key: TKM_KEY_0 ~ TKM_KEY_3
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void TKM_KeyCmd(TKM_Enum TKMn, TKM_KEY_Enum Key, ControlStatus NewState)
{
  HT_TKM_TypeDef *TKMx = (HT_TKM_TypeDef *)((u32)&HT_TKEY->TKM0 + (TKMn * 0x100));

  /* Check the parameters                                                                                   */
  Assert_Param(IS_TKM(TKMn));
  Assert_Param(IS_TKM_KEY(Key));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    TKMx->KCFGR |= (1 << Key);
  }
  else
  {
    TKMx->KCFGR &= ~(1 << Key);
  }
}

/*********************************************************************************************************//**
 * @brief Configure the Time Slot X key selection (for auto scan mode & Periodic auto scan mode).
 * @param TKMn: TKM_0 ~ TKM_5
 * @param Slot: TKM_TIME_SLOT_0 ~ TKM_TIME_SLOT_3
 * @param Key: TKM_KEY_0 ~ TKM_KEY_3
 * @retval None
 ************************************************************************************************************/
void TKM_TimeSlotKeyConfig(TKM_Enum TKMn, TKM_TIME_SLOT_Enum Slot, TKM_KEY_Enum Key)
{
  HT_TKM_TypeDef *TKMx = (HT_TKM_TypeDef *)((u32)&HT_TKEY->TKM0 + (TKMn * 0x100));
  u32 offset = (16 + (Slot * 2));

  /* Check the parameters */
  Assert_Param(IS_TKM(TKMn));
  Assert_Param(IS_TKM_TIME_SLOT(Slot));
  Assert_Param(IS_TKM_KEY(Key));

  TKMx->KCFGR = (TKMx->KCFGR & ~(3 << offset)) | (Key << offset);
}

/*********************************************************************************************************//**
 * @brief Configure the Key threshold.
 * @param TKMn: TKM_0 ~ TKM_5
 * @param Key: TKM_KEY_0 ~ TKM_KEY_3
 * @param Sel: Specify the Key threshold.
 *   This parameter can be one of the following values:
 *     @arg TKM_KEY_THR_LOWER :
 *     @arg TKM_KEY_THR_UPPER :
 * @retval None
 ************************************************************************************************************/
void TKM_KeyThresholdConfig(TKM_Enum TKMn, TKM_KEY_Enum Key, TKM_KEY_THR_Enum Sel)
{
  HT_TKM_TypeDef *TKMx = (HT_TKM_TypeDef *)((u32)&HT_TKEY->TKM0 + (TKMn * 0x100));
  u32 offset = (8 + Key);

  /* Check the parameters                                                                                   */
  Assert_Param(IS_TKM(TKMn));
  Assert_Param(IS_TKM_KEY(Key));
  Assert_Param(IS_TKM_KEY_THR(Sel));

  TKMx->KCFGR = (TKMx->KCFGR & ~(1 << offset)) | (Sel << offset);
}

/*********************************************************************************************************//**
 * @brief Check whether the specified key threshold match flag has been set or not.
 * @param TKMn: TKM_0 ~ TKM_5
 * @param Key: TKM_KEY_0 ~ TKM_KEY_3
 * @retval SET or RESET
 ************************************************************************************************************/
FlagStatus TKM_GetMatchFlagStatus(TKM_Enum TKMn, TKM_KEY_Enum Key)
{
  HT_TKM_TypeDef *TKMx = (HT_TKM_TypeDef *)((u32)&HT_TKEY->TKM0 + (TKMn * 0x100));

  /* Check the parameters                                                                                   */
  Assert_Param(IS_TKM(TKMn));
  Assert_Param(IS_TKM_KEY(Key));

  if ((TKMx->SR & (1 << Key)) != RESET)
  {
    return SET;
  }
  else
  {
    return RESET;
  }
}

/*********************************************************************************************************//**
 * @brief Clear the specified key threshold match flag.
 * @param TKMn: TKM_0 ~ TKM_5
 * @param Key: TKM_KEY_0 ~ TKM_KEY_3
 * @retval None
 ************************************************************************************************************/
void TKM_ClearMatchFlag(TKM_Enum TKMn, TKM_KEY_Enum Key)
{
  HT_TKM_TypeDef *TKMx = (HT_TKM_TypeDef *)((u32)&HT_TKEY->TKM0 + (TKMn * 0x100));

  /* Check the parameters                                                                                   */
  Assert_Param(IS_TKM(TKMn));
  Assert_Param(IS_TKM_KEY(Key));

  TKMx->SR = (1 << Key);
}

/*********************************************************************************************************//**
 * @brief Set the reference OSC capacitor value.
 * @param TKMn: TKM_0 ~ TKM_5
 * @param Value: Specify the capacitor value between 0x000 ~ 0x3FF.
 * @retval None
 ************************************************************************************************************/
void TKM_SetRefOSCCapacitor(TKM_Enum TKMn, u32 Value)
{
  HT_TKM_TypeDef *TKMx = (HT_TKM_TypeDef *)((u32)&HT_TKEY->TKM0 + (TKMn * 0x100));

  /* Check the parameters                                                                                   */
  Assert_Param(IS_TKM(TKMn));

  TKMx->ROCPR = Value;
}

/*********************************************************************************************************//**
 * @brief Get the reference OSC capacitor value.
 * @param TKMn: TKM_0 ~ TKM_5
 * @retval The capacitor value
 ************************************************************************************************************/
u32 TKM_GetRefOSCCapacitor(TKM_Enum TKMn)
{
  HT_TKM_TypeDef *TKMx = (HT_TKM_TypeDef *)((u32)&HT_TKEY->TKM0 + (TKMn * 0x100));

  /* Check the parameters                                                                                   */
  Assert_Param(IS_TKM(TKMn));

  return TKMx->ROCPR;
}

/*********************************************************************************************************//**
 * @brief Set the key capacitor value.
 * @param TKMn: TKM_0 ~ TKM_5
 * @param Key: TKM_KEY_0 ~ TKM_KEY_3
 * @param Value: Specify the capacitor value between 0x000 ~ 0x3FF.
 * @retval None
 ************************************************************************************************************/
void TKM_SetKeyCapacitor(TKM_Enum TKMn, TKM_KEY_Enum Key, u32 Value)
{
  HT_TKM_TypeDef *TKMx = (HT_TKM_TypeDef *)((u32)&HT_TKEY->TKM0 + (TKMn * 0x100));

