RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f5xxxx_tkey.c
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TKM(TKMn));
  Assert_Param(IS_TKM_KEY(Key));

  *(vu32*)((u32)&TKMx->K3CPR + ((3 - Key) * 4)) = Value;
}

/*********************************************************************************************************//**
 * @brief Get the key capacitor value.
 * @param TKMn: TKM_0 ~ TKM_5
 * @param Key: TKM_KEY_0 ~ TKM_KEY_3
 * @retval The capacitor value
 ************************************************************************************************************/
u32 TKM_GetKeyCapacitor(TKM_Enum TKMn, TKM_KEY_Enum Key)
{
  HT_TKM_TypeDef *TKMx = (HT_TKM_TypeDef *)((u32)&HT_TKEY->TKM0 + (TKMn * 0x100));

  /* Check the parameters                                                                                   */
  Assert_Param(IS_TKM(TKMn));
  Assert_Param(IS_TKM_KEY(Key));

  return *(vu32*)((u32)&TKMx->K3CPR + ((3 - Key) * 4));
}

/*********************************************************************************************************//**
 * @brief Get the 16-bit C/F counter value.
 * @param TKMn: TKM_0 ~ TKM_5
 * @retval The counter value
 ************************************************************************************************************/
u32 TKM_Get16BitCFCounterValue(TKM_Enum TKMn)
{
  HT_TKM_TypeDef *TKMx = (HT_TKM_TypeDef *)((u32)&HT_TKEY->TKM0 + (TKMn * 0x100));

  /* Check the parameters                                                                                   */
  Assert_Param(IS_TKM(TKMn));

  return TKMx->CFCNTR;
}

/*********************************************************************************************************//**
 * @brief Get the key counter value.
 * @param TKMn: TKM_0 ~ TKM_5
 * @param Key: TKM_KEY_0 ~ TKM_KEY_3
 * @retval None
 ************************************************************************************************************/
u32 TKM_GetKeyCounterValue(TKM_Enum TKMn, TKM_KEY_Enum Key)
{
  HT_TKM_TypeDef *TKMx = (HT_TKM_TypeDef *)((u32)&HT_TKEY->TKM0 + (TKMn * 0x100));

  /* Check the parameters                                                                                   */
  Assert_Param(IS_TKM(TKMn));
  Assert_Param(IS_TKM_KEY(Key));

  return *(vu32*)((u32)&TKMx->K3CNTR + ((3 - Key) * 4));
}

/*********************************************************************************************************//**
 * @brief Set the key threshold value.
 * @param TKMn: TKM_0 ~ TKM_5
 * @param Key: TKM_KEY_0 ~ TKM_KEY_3
 * @param Value: Specify the key threshold value between 0x0000 ~ 0xFFFF.
 * @retval None
 ************************************************************************************************************/
void TKM_SetKeyThreshold(TKM_Enum TKMn, TKM_KEY_Enum Key, u32 Value)
{
  HT_TKM_TypeDef *TKMx = (HT_TKM_TypeDef *)((u32)&HT_TKEY->TKM0 + (TKMn * 0x100));

  /* Check the parameters                                                                                   */
  Assert_Param(IS_TKM(TKMn));
  Assert_Param(IS_TKM_KEY(Key));

  *(vu32*)((u32)&TKMx->K3THR + ((3 - Key) * 4)) = Value;
}

/*********************************************************************************************************//**
 * @brief Get the key threshold value.
 * @param TKMn: TKM_0 ~ TKM_5
 * @param Key: TKM_KEY_0 ~ TKM_KEY_3
 * @retval The threshold value
 ************************************************************************************************************/
u32 TKEY_GetKeyThreshold(TKM_Enum TKMn, TKM_KEY_Enum Key)
{
  HT_TKM_TypeDef *TKMx = (HT_TKM_TypeDef *)((u32)&HT_TKEY->TKM0 + (TKMn * 0x100));

  /* Check the parameters                                                                                   */
  Assert_Param(IS_TKM(TKMn));
  Assert_Param(IS_TKM_KEY(Key));

  return *(vu32*)((u32)&TKMx->K3THR + ((3 - Key) * 4));
}
/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */
